'use strict'

const ul = document.querySelector('ul');

ul.addEventListener('click', function(event) {
    // Приклад, як потрібно виконати кожне завдання:
    // 0. Вивести повну інформацію про подію та вказати тип даних
    event.preventDefault();
    console.dir(event) //Object
    
    // 1. Вивести інформацію про тип події
    console.log('Тип події:', event.type);

    // 2. Вивести інформацію про цільовий об'єкт, на якому сталася подія
    console.log('Цільовий елемент:', event.target);

    // 3. Вивести інформацію про батьківський об'єкт відносно цільового об'єкта
    console.log('Батьківський елемент:', event.target.parentElement);

    // 4. Вивести інформацію про те, чи було натиснуто при виникненні події клавішу Ctrl
    console.log('Ctrl було натиснуто:', event.ctrlKey);

    // 5. Вивести інформацію про те, чи було натиснуто при виникненні події клавішу Shift
    console.log('Shift було натиснуто:', event.shiftKey);

    // 6. Вивести інформацію про те, чи було натиснуто при виникненні події клавішу Alt
    console.log('Alt було натиснуто:', event.altKey);

    // 7. Вивести інформацію про координати миші відносно лівого краю браузера в момент виникнення події
    console.log('Координата Х(відносно браузера):', event.clientX);

    // 8. Вивести інформацію про координати миші відносно лівого краю монітора в момент виникнення події
    console.log('Координата X(відносно монітору):', event.screenX);

    // 9. Вивести інформацію про те, чи призупинено стандартну поведінку браузера
    console.log('Стандартна поведінка ввімкнена?:', event.defaultPrevented);

    // 10. Вивести інформацію про напрямок обробки події (спливання чи захоплення)
    console.log('Напрямок обробки події:', event.eventPhase === Event.CAPTURING_PHASE ? 'Захоплення' : 'Спливання');
})

